Revit 2027 API
BuiltInFailures.MassFailures.UpgradedMassingWarning Property
 Your document contained a Massing element which has been upgraded to a Mass instance. Please review the documentation on the new enhanced Mass capabilities to understand the implications of this change.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UpgradedMassingWarning { get; }
Public Shared ReadOnly Property UpgradedMassingWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UpgradedMassingWarning {
	FailureDefinitionId^ get ();
}
static member UpgradedMassingWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace